UNITS_NOMINATIVE = ['', 'один', 'два', 'три', 'чотири', 'п\'ять', 'шість', 'сім', 'вісім', 'дев\'ять']
UNITS_GENITIVE = ['', 'одиного', 'двох', 'трьох', 'чотирьох', 'п\'яти/п\'ятьох', 'шести/шістьох', 'семи/сімох',
                  'восьми/вісьмох', 'дев\'яти/дев\'ятьох']
UNITS_DATIVE = ['', 'одиному', 'двом', 'трьом', 'чотирьом', 'п\'яти/п\'ятьом', 'шести/шістьом', 'семи/сімом',
                'восьми/вісьмом', 'дев\'яти/дев\'ятьом']
UNITS_ACCUSATIVE = ['', 'один/одного', 'два/двох', 'три/трьох', 'чотири/чотирьох', 'п\'ять/п\'ятьох', 'шість/шістьох',
                    'сім/сімох',
                    'вісім/вісьмох', 'дев\'ять/дев\'ятьох']
UNITS_ABLATIVE = ['', 'одним', 'двома', 'трьома', 'чотирма', 'п\'ятьма/п\'ятьома', 'шістьма/шістьома', 'сьома/сімома',
                  'вісьма/вісьмома', 'дев\'ятьма/дев\'ятьома']
UNITS_LOCAL = ['', 'одному/однім', 'двох', 'трьох', 'чотирьох', 'п\'яти/п\'ятьох', 'шести/шістьох', 'семи/сімох',
               'восьми/вісьмох', 'дев\'яти/дев\'ятьох']

TEENS_NOMINATIVE = ['десять', 'одинадцять', 'дванадцять', 'тринадцять', 'чотирнадцять', 'п\'ятнадцять', 'шістнадцять',
                    'сімнадцять', 'вісімнадцять', 'дев\'ятнадцять']
TEENS_GENITIVE = ['десяти/десятьох', 'одинадцяти/одинадцятьох', 'дванадцяти/дванадцятьох', 'тринадцяти/тринадцятьох',
                  'чотирнадцяти/чотирнадцятьох', 'п\'ятнадцяти/п\'ятнадцятьох', 'шістнадцяти/шістнадцятьох',
                  'сімнадцяти/сімнадцятьох', 'вісімнадцяти/вісімнадцятьох', 'дев\'ятнадцяти/дев\'ятнадцятьох']
TEENS_DATIVE = ['десяти/десятьом', 'одинадцяти/одинадцятьом', 'дванадцяти/дванадцятьом', 'тринадцяти/тринадцятьом',
                'чотирнадцяти/чотирнадцятьом', 'п\'ятнадцяти/п\'ятнадцятьом', 'шістнадцяти/шістнадцятьом',
                'сімнадцяти/сімнадцятьом', 'вісімнадцяти/вісімнадцятьом', 'дев\'ятнадцяти/дев\'ятнадцятьом']
TEENS_ACCUSATIVE = ['десять/десятьох', 'одинадцять/одинадцятьох', 'дванадцять/дванадцятьох', 'тринадцять/тринадцятьох',
                    'чотирнадцять/чотирнадцятьох', 'п\'ятнадцять/п\'ятнадцятьох', 'шістнадцять/шістнадцятьох',
                    'сімнадцять/сімнадцятьох', 'вісімнадцять/вісімнадцятьох', 'дев\'ятнадцять/дев\'ятнадцятьох']
TEENS_ABLATIVE = ['десятьма/десятьома', 'одинадцятьма/одинадцятьома', 'дванадцятьма/дванадцятьома',
                  'тринадцятьма/тринадцятьома', 'чотирнадцятьма/чотирнадцятьома', 'п\'ятнадцятьма/п\'ятнадцятьома',
                  'шістнадцятьма/шістнадцятьома', 'сімнадцятьма/сімнадцятьома', 'вісімнадцятьма/вісімнадцятьома',
                  'дев\'ятнадцятьма/дев\'ятнадцятьома']
TEENS_LOCAL = ['десяти/десятьох', 'одинадцяти/одинадцятьох', 'дванадцяти/дванадцятьох', 'тринадцяти/тринадцятьох',
               'чотирнадцяти/чотирнадцятьох', 'п\'ятнадцяти/п\'ятнадцятьох', 'шістнадцяти/шістнадцятьох',
               'сімнадцяти/сімнадцятьох', 'вісімнадцяти/вісімнадцятьох', 'дев\'ятнадцяти/дев\'ятнадцятьох']

TENS_NOMINATIVE = ['', '', 'двадцять', 'тридцять', 'сорок', 'п\'ятдесят', 'шістдесят', 'сімдесят', 'вісімдесят',
                   'дев\'яносто']
TENS_GENITIVE = ['', '', 'двадцяти/двадцятьох', 'тридцяти/тридцятьох', 'сорока', 'п\'ятдесяти/п\'ятдесятьох',
                 'шістдесяти/шістдесятьох', 'сімдесяти/сімдесятьох', 'вісімдесяти/вісімдесятьох', 'дев\'яноста']
TENS_DATIVE = ['', '', 'двадцяти/двадцятьом', 'тридцяти/тридцятьом', 'сорока', 'п\'ятдесяти/п\'ятдесятьом',
               'шістдесяти/шістдесятьом', 'сімдесяти/сімдесятьом', 'вісімдесяти/вісімдесятьом', 'дев\'яноста']
TENS_ACCUSATIVE = ['', '', 'двадцять/двадцятьох', 'тридцять/тридцятьох', 'сорок', 'п\'ятдесят/п\'ятдесятьох',
                   'шістдесят/шістдесятьох', 'сімдесят/сімдесятьох', 'вісімдесят/вісімдесятьох', 'дев\'яносто']
TENS_ABLATIVE = ['', '', 'двадцятьма/двадцятьома', 'тридцятьма/тридцятьома', 'сорока', 'п\'ятдесятьма/п\'ятдесятьома',
                 'шістдесятьма/шістдесятьома', 'сімдесятьма/сімдесятьома', 'вісімдесятьма/вісімдесятьома',
                 'дев\'яноста']
TENS_LOCAL = ['', '', 'двадцяти/двадцятьох', 'тридцяти/тридцятьох', 'сорока', 'п\'ятдесяти/п\'ятдесятьох',
              'шістдесяти/шістдесятьох', 'сімдесяти/сімдесятьох', 'вісімдесяти/вісімдесятьох', 'дев\'яноста']

HUNDREDS_NOMINATIVE = ['', 'сто', 'двісті', 'триста', 'чотириста', 'п\'ятсот', 'шістсот', 'сімсот', 'вісімсот',
                       'дев\'ятсот']
HUNDREDS_GENITIVE = ['', 'ста', 'двохсот', 'трьохсот', 'чотирьохсот', 'п\'ятисот', 'шестисот', 'семисот', 'восьмисот',
                     'дев\'ятисот']
HUNDREDS_DATIVE = ['', 'ста', 'двомстам', 'трьомстам', 'чотирьомстам', 'п\'ятистам', 'шестистам', 'семистам',
                   'восьмистам', 'дев\'ятистам']
HUNDREDS_ACCUSATIVE = ['', 'сто', 'двісті', 'триста', 'чотириста', 'п\'ятсот', 'шістсот', 'сімсот', 'вісімсот',
                       'дев\'ятсот']
HUNDREDS_ABLATIVE = ['', 'ста', 'двомастами', 'трьомастами', 'чотирмастами', 'п\'ятьмастами/п\'ятьомастами',
                     'шістьмастами/шістьомастами', 'сьомастами/сімомастами', 'вісьмастами/вісьмомастами',
                     'дев\'ятьмастами/дев\'ятьомастами']
HUNDREDS_LOCAL = ['', 'ста', 'двохстах', 'трьохстах', 'чотирьохстах', 'п\'ятистах', 'шестистах', 'семистах',
                  'восьмистах', 'дев\'ятистах']
THOUSANDS_NOMINATIVE = ['', 'тисяча', 'тисячі', 'тисячі', 'тисячі', 'тисяч', 'тисяч', 'тисяч', 'тисяч', 'тисяч']
THOUSANDS_GENITIVE = ['', 'тисячі', 'тисяч', 'тисяч', 'тисяч', 'тисяч', 'тисяч', 'тисяч', 'тисяч', 'тисяч']
THOUSANDS_DATIVE = ['', 'тисячі', 'тисячам', 'тисячам', 'тисячам', 'тисячам', 'тисячам', 'тисячам', 'тисячам',
                    'тисячам']
THOUSANDS_ACCUSATIVE = ['', 'тисячу', 'тисячі', 'тисячі', 'тисячі', 'тисяч', 'тисяч', 'тисяч', 'тисяч', 'тисяч']
THOUSANDS_ABLATIVE = ['', 'тисячею', 'тисячами', 'тисячами', 'тисячами', 'тисячами', 'тисячами', 'тисячами', 'тисячами',
                      'тисячами']
THOUSANDS_LOCAL = ['', 'тисячі', 'тисячах', 'тисячах', 'тисячах', 'тисячах', 'тисячах', 'тисячах', 'тисячах', 'тисячах']

CASES = {
    0: [UNITS_NOMINATIVE, TEENS_NOMINATIVE, TENS_NOMINATIVE, HUNDREDS_NOMINATIVE],
    1: [UNITS_GENITIVE, TEENS_GENITIVE, TENS_GENITIVE, HUNDREDS_GENITIVE],
    2: [UNITS_DATIVE, TEENS_DATIVE, TENS_DATIVE, HUNDREDS_DATIVE],
    3: [UNITS_ACCUSATIVE, TEENS_ACCUSATIVE, TENS_ACCUSATIVE, HUNDREDS_ACCUSATIVE],
    4: [UNITS_ABLATIVE, TEENS_ABLATIVE, TENS_ABLATIVE, HUNDREDS_ABLATIVE],
    5: [UNITS_LOCAL, TEENS_LOCAL, TENS_LOCAL, HUNDREDS_LOCAL]
}

THOUSANDS = [THOUSANDS_NOMINATIVE, THOUSANDS_GENITIVE, THOUSANDS_DATIVE, THOUSANDS_ACCUSATIVE, THOUSANDS_ABLATIVE,
             THOUSANDS_LOCAL]

